In [11]:
import pandas as pd

In [12]:
from sqlalchemy import create_engine

In [13]:
conn_string = 'mysql://root:rohan5455@localhost:3306/paint'
db = create_engine(conn_string)
conn = db.connect()

In [25]:
files = ['artist','canvas_size','image_link','museum','museum_hours','product_size','subject','work']
for file in files:
        df = pd.read_csv(f"C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\{file}.csv")
        df.to_sql(file,con=conn,if_exists='replace',index=False)

In [43]:
df1 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\artist.csv")
df1.head()

,artist_id,full_name,first_name,middle_names,last_name,nationality,style,birth,death
0,500,Pierre-Auguste Renoir,Pierre,Auguste,Renoir,French,Impressionist,1841,1919
1,501,Alexandre Cabanel,Alexandre,NaN,Cabanel,French,Classicist,1823,1889
2,502,James Ensor,James,NaN,Ensor,Belgian,Expressionist,1860,1949
3,503,Maximilien Luce,Maximilien,NaN,Luce,French,Pointillist,1858,1941
4,504,August Macke,August,NaN,Macke,German,Expressionist,1887,1914

In [82]:
df1.shape

(421, 9)

In [42]:
df1.describe()

        artist_id        birth        death
count  421.000000   421.000000   421.000000
mean   710.000000  1771.838480  1838.171021
std    121.676484   115.479611   118.873679
min    500.000000  1395.000000  1441.000000
25%    605.000000  1715.000000  1787.000000
50%    710.000000  1824.000000  1892.000000
75%    815.000000  1859.000000  1926.000000
max    920.000000  1903.000000  1989.000000

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   artist_id     421 non-null    int64
 1   full_name     421 non-null    object
 2   first_name    421 non-null    object
 3   middle_names  148 non-null    object
 4   last_name     421 non-null    object
 5   nationality   421 non-null    object
 6   style         421 non-null    object
 7   birth         421 non-null    int64
 8   death         421 non-null    int64
dtypes: int64(3), object(6)
memory usage: 29.7+ KB

In [45]:
df1.columns

Index(['artist_id', 'full_name', 'first_name', 'middle_names', 'last_name',
       'nationality', 'style', 'birth', 'death'],
      dtype='object')

In [81]:
df1.dtypes

artist_id        int64
full_name       object
first_name      object
middle_names    object
last_name       object
nationality     object
style           object
birth            int64
death            int64
dtype: object

In [46]:
df2 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\canvas_size.csv")
df2.head()

   size_id  width  height          label
0       20     20     NaN  20" Long Edge
1       24     24     NaN  24" Long Edge
2       30     30     NaN  30" Long Edge
3       36     36     NaN  36" Long Edge
4       40     40     NaN  40" Long Edge

In [83]:
df2.shape

(200, 4)

In [47]:
df2.describe()

           size_id      width      height
count   200.000000  200.00000  193.000000
mean   3712.895000   38.03000   36.917098
std    1723.788732   15.82756   14.769174
min      20.000000   15.00000   16.000000
25%    2531.750000   26.00000   26.000000
50%    3539.500000   36.00000   34.000000
75%    4532.500000   46.00000   43.000000
max    9648.000000   96.00000   96.000000

In [48]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   size_id  200 non-null    int64
 1   width    200 non-null    int64
 2   height   193 non-null    float64
 3   label    200 non-null    object
dtypes: float64(1), int64(2), object(1)
memory usage: 6.4+ KB

In [49]:
df2.columns

Index(['size_id', 'width', 'height', 'label'], dtype='object')

In [80]:
df2.dtypes

size_id      int64
width        int64
height     float64
label       object
dtype: object

In [50]:
df3 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\image_link.csv")
df3.head()

,work_id,url,thumbnail_small_url,thumbnail_large_url
0,181978,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
1,173188,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
2,194065,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
3,129337,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
4,141073,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...

In [84]:
df3.shape

(14775, 4)

In [51]:
df3.describe()

             work_id
count   14775.000000
mean    79437.560271
std     74408.411858
min       178.000000
25%     18393.000000
50%     28453.000000
75%    150417.500000
max    209770.000000

In [52]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14775 entries, 0 to 14774
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   work_id              14775 non-null  int64
 1   url                  14775 non-null  object
 2   thumbnail_small_url  14773 non-null  object
 3   thumbnail_large_url  14773 non-null  object
dtypes: int64(1), object(3)
memory usage: 461.8+ KB

In [53]:
df3.columns

Index(['work_id', 'url', 'thumbnail_small_url', 'thumbnail_large_url'], dtype='object')

In [79]:
df3.dtypes

work_id                 int64
url                    object
thumbnail_small_url    object
thumbnail_large_url    object
dtype: object

In [54]:
df4 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\museum.csv")
df4.head()

,museum_id,name,address,city,state,postal,country,phone,url
0,30,The Museum of Modern Art,11 W 53rd St,New York,NY,10019,USA,+1 212 708-9400,https://www.moma.org/
1,31,Pushkin State Museum of Fine Arts,12 Ulitsa Volkhonka,Moscow,NaN,119019,Russia,+7 495 697-95-78,https://pushkinmuseum.art/
2,32,National Gallery of Victoria,180 St Kilda Rd,Melbourne,Victoria,3004,Australia,+61 (0)3 8620 2222,https://www.ngv.vic.gov.au/
3,33,São Paulo Museum of Art,"Av. Paulista, 1578 - Bela Vista",São Paulo,NaN,01310-200,Brazil,+55 11 3149-5959,https://masp.org.br/
4,34,The State Hermitage Museum,Palace Square,2,Sankt-Peterburg,190000,Russia,7 812 710-90-79,https://www.hermitagemuseum.org/wps/portal/her...

In [85]:
df4.shape

(57, 9)

In [55]:
df4.describe()

       museum_id
count  57.000000
mean   58.000000
std    16.598193
min    30.000000
25%    44.000000
50%    58.000000
75%    72.000000
max    86.000000

In [56]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  57 non-null     int64
 1   name       57 non-null     object
 2   address    57 non-null     object
 3   city       57 non-null     object
 4   state      38 non-null     object
 5   postal     50 non-null     object
 6   country    57 non-null     object
 7   phone      57 non-null     object
 8   url        57 non-null     object
dtypes: int64(1), object(8)
memory usage: 4.1+ KB

In [57]:
df4.columns

Index(['museum_id', 'name', 'address', 'city', 'state', 'postal', 'country',
       'phone', 'url'],
      dtype='object')

In [78]:
df4.dtypes

museum_id     int64
name         object
address      object
city         object
state        object
postal       object
country      object
phone        object
url          object
dtype: object

In [58]:
df5 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\museum_hours.csv")
df5.head()

   museum_id        day      open     close
0         30     Sunday  10:30:AM  05:30:PM
1         30     Monday  10:30:AM  05:30:PM
2         30    Tuesday  10:30:AM  05:30:PM
3         30  Wednesday  10:30:AM  05:30:PM
4         30    Thusday  10:30:AM  05:30:PM

In [86]:
df5.shape

(351, 4)

In [59]:
df5.describe()

        museum_id
count  351.000000
mean    57.780627
std     16.640064
min     30.000000
25%     43.500000
50%     58.000000
75%     72.000000
max     86.000000

In [60]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  351 non-null    int64
 1   day        351 non-null    object
 2   open       351 non-null    object
 3   close      351 non-null    object
dtypes: int64(1), object(3)
memory usage: 11.1+ KB

In [61]:
df5.columns

Index(['museum_id', 'day', 'open', 'close'], dtype='object')

In [77]:
df5.dtypes

museum_id     int64
day          object
open         object
close        object
dtype: object

In [62]:
df6 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\product_size.csv")
df6.head()

   work_id size_id  sale_price  regular_price
0   160228      24          85             85
1   160228      30          95             95
2   160236      24          85             85
3   160236      30          95             95
4   160244      24          85             85

In [87]:
df6.shape

(110347, 4)

In [63]:
df6.describe()

             work_id     sale_price  regular_price
count  110347.000000  110347.000000  110347.000000
mean    78651.654227     413.775653     746.012352
std     73617.239155     192.176274     383.403091
min       178.000000      10.000000      75.000000
25%     18210.000000     285.000000     485.000000
50%     28435.000000     365.000000     655.000000
75%    147731.000000     535.000000     975.000000
max    209770.000000    1115.000000    2235.000000

In [64]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110347 entries, 0 to 110346
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   work_id        110347 non-null  int64
 1   size_id        110347 non-null  object
 2   sale_price     110347 non-null  int64
 3   regular_price  110347 non-null  int64
dtypes: int64(3), object(1)
memory usage: 3.4+ MB

In [65]:
df6.columns

Index(['work_id', 'size_id', 'sale_price', 'regular_price'], dtype='object')

In [66]:
df6.dtypes

work_id           int64
size_id          object
sale_price        int64
regular_price     int64
dtype: object

In [67]:
df7 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\subject.csv")
df7.head()

   work_id     subject
0   160228  Still-Life
1   160236  Still-Life
2   160244  Still-Life
3   160252  Still-Life
4   160260  Still-Life

In [88]:
df7.shape

(6771, 2)

In [68]:
df7.describe()

             work_id
count    6771.000000
mean    70336.844779
std     72110.052886
min       179.000000
25%      7932.000000
50%     27036.000000
75%    142446.000000
max    209533.000000

In [69]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6771 entries, 0 to 6770
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   work_id  6771 non-null   int64
 1   subject  6771 non-null   object
dtypes: int64(1), object(1)
memory usage: 105.9+ KB

In [70]:
df7.columns

Index(['work_id', 'subject'], dtype='object')

In [71]:
df7.dtypes

work_id     int64
subject    object
dtype: object

In [72]:
df8 = pd.read_csv("C:\\Users\\ROHAN VERMA R11\\Desktop\\CaseStudy Painting project\\work.csv")
df8.head()

,work_id,name,artist_id,style,museum_id
0,160228,Still Life with Flowers and a Watch,615,Baroque,43.0
1,160236,Still Life with Fruit and a Beaker on a Cock's...,615,Baroque,43.0
2,160244,Still Life with Fruit and a Goldfinch,615,Baroque,43.0
3,160252,Still Life with Fruit and Oysters,615,Baroque,43.0
4,160260,"Still Life with Fruit, Oysters, and a Porcelai...",615,Baroque,43.0

In [89]:
df8.shape

(14776, 5)

In [73]:
df8.describe()

             work_id     artist_id    museum_id
count   14776.000000  14776.000000  4553.000000
mean    79440.697685    694.726990    46.833736
std     74406.871138    127.179277    10.063017
min       178.000000    500.000000    30.000000
25%     18393.500000    576.000000    35.000000
50%     28454.000000    688.000000    47.000000
75%    150414.750000    803.000000    51.000000
max    209770.000000    920.000000    86.000000

In [74]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14776 entries, 0 to 14775
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   work_id    14776 non-null  int64
 1   name       14776 non-null  object
 2   artist_id  14776 non-null  int64
 3   style      13490 non-null  object
 4   museum_id  4553 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 577.3+ KB

In [75]:
df8.columns

Index(['work_id', 'name', 'artist_id', 'style', 'museum_id'], dtype='object')

In [76]:
df8.dtypes

work_id        int64
name          object
artist_id      int64
style         object
museum_id    float64
dtype: object